In [1]:
import pandas as pd

In [2]:
file = "../Solved/Resources/sampleData.csv"

In [3]:
df_original = pd.read_csv(file)
df_original.head()

   id first_name   last_name       Phone Number      Time zone
0   1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3   4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4   5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [4]:
df = df_original.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023  Europe/Moscow
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [5]:
berry_phone = df.loc["Berry", "Phone Number"]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[1, 2]
print("Using Iloc: " + also_berry_phone)

Using Loc: 86-(614)973-1727
Using Iloc: 86-(614)973-1727

In [6]:
richardson_to_morales = df.loc[["Richardson", "Berry", "Hudson", "McDonald", "Morales"], ["id", "first_name", "last_name"]]
print(richardson_to_morales)

              id first_name  last_name
last_name
Richardson   1.0      Peter        NaN
Richardson  25.0     Donald        NaN
Berry        2.0     Janice        NaN
Hudson       3.0     Andrea        NaN
Hudson       8.0    Frances        NaN
Hudson      90.0      Norma        NaN
McDonald     NaN        NaN        NaN
Morales      5.0      Kathy        NaN

/anaconda3/envs/PythonData/lib/python3.6/site-packages/pandas/core/indexing.py:1472: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

In [7]:
also_richardson_to_morales = df.iloc[0:4, 0:3]
print(also_richardson_to_morales)

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783

In [8]:
df.loc[:, ["first_name", "Phone Number"]].head(10)

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124
Reyes            Juan  507-(957)942-8540
Kim            Joseph   62-(764)534-1192
Hudson        Frances   57-(752)864-4744
Day              Judy    7-(863)797-2311
Ford           Robert   92-(784)853-3450

In [9]:
named_billy = df["first_name"] == "Billy"
named_billy.head(20)

last_name
Richardson    False
Berry         False
Hudson        False
Mcdonald      False
Morales       False
Reyes         False
Kim           False
Hudson        False
Day           False
Ford          False
Jones         False
Hamilton      False
Martin        False
Cook          False
Burke         False
Kim           False
Collins       False
Day           False
Montgomery    False
Clark          True
Name: first_name, dtype: bool

In [10]:
only_billy = df.loc[df["first_name"] == "Billy", :]
print(only_billy)

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai

In [12]:
only_billy_and_peter = df.loc[(df["first_name"] == "Billy")|(df["first_name"] == "Peter")]
print(only_billy_and_peter)

            id first_name      Phone Number       Time zone
last_name
Richardson   1      Peter   7-(789)867-9023   Europe/Moscow
Clark       20      Billy  62-(213)345-2549   Asia/Makassar
Andrews     23      Billy  86-(859)746-5367  Asia/Chongqing
Price       59      Billy  86-(878)547-7739   Asia/Shanghai